Revit 2027 API
Family.StructuralCodeName Property
 The family's structural code name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string StructuralCodeName { get; set; }
Public Property StructuralCodeName As String
	Get
	Set
public:
property String^ StructuralCodeName {
	String^ get ();
	void set (String^ value);
}
member StructuralCodeName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace